<a href="https://colab.research.google.com/github/Sudhaganisrinidhi/B_20_1342/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print("pandas Series:")
print(series)

pandas Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
import pandas as pd
data=[10,20,30,40,50]
index_label=['a','b','c','d','e']
Series=pd.Series(data,index=index_label)
print(Series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [9]:
import pandas as pd
data={
'Name':['alice','bob','charlie','david'],
'Age':[25,30,35,49],
'City':['hyd','delhi','chennai','mumbai']
}
df=pd.DataFrame(data)
print(df)

      Name  Age     City
0    alice   25      hyd
1      bob   30    delhi
2  charlie   35  chennai
3    david   49   mumbai

In [10]:
print(df['Name'])

0      alice
1        bob
2    charlie
3      david
Name: Name, dtype: object

In [11]:
print(df[['Name','City']])

      Name     City
0    alice      hyd
1      bob    delhi
2  charlie  chennai
3    david   mumbai

In [12]:
print(df.iloc[1])
print(df.loc[2])

Name      bob
Age        30
City    delhi
Name: 1, dtype: object
Name    charlie
Age          35
City    chennai
Name: 2, dtype: object

In [13]:
df['Salary']=[40000,50000,60000,70000]
print(df)

      Name  Age     City  Salary
0    alice   25      hyd   40000
1      bob   30    delhi   50000
2  charlie   35  chennai   60000
3    david   49   mumbai   70000

In [14]:
df=df.drop('City',axis=1)
print(df)

      Name  Age  Salary
0    alice   25   40000
1      bob   30   50000
2  charlie   35   60000
3    david   49   70000

In [ ]:
print(df[df['Age']>30])

      Name  Age  Salary
2  charlie   35   60000
3    david   49   70000

In [ ]:
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

34.75
49
25

In [16]:
import pandas as pd
student_data={
    'Student_ID':[101,102,103,104],
    'Name':['ravi','neha','kiran','sita'],
    'Marks':[85,90,78,82],
    'Department':['CSE','ECE','MECH','CSE']
}
df=pd.DataFrame(student_data)
print("Student Data:")
print(df)

Student Data:
   Student_ID   Name  Marks Department
0         101   ravi     85        CSE
1         102   neha     90        ECE
2         103  kiran     78       MECH
3         104   sita     82        CSE

In [17]:
print("\nStudents with Marks greater than 80:")
print(df[df['Marks']>80])

Students with Marks greater than 80:
   Student_ID  Name  Marks Department
0         101  ravi     85        CSE
1         102  neha     90        ECE
3         104  sita     82        CSE

In [18]:
print("\nAveage Marks:",df['Marks'].mean())
df['Result']=['Pass' if x>=40 else 'Fail' for x in df['Marks']]
print("\nWith Result Column:")
print(df)

Aveage Marks: 83.75

With Result Column:
   Student_ID   Name  Marks Department Result
0         101   ravi     85        CSE   Pass
1         102   neha     90        ECE   Pass
2         103  kiran     78       MECH   Pass
3         104   sita     82        CSE   Pass